<div class="mb-4">
    <a class="nav-link" data-toggle="collapse" href="#collapseInstruction" role="button" aria-expanded="false" aria-controls="collapseInstruction">
        Інструкція користувачеві
    </a>
    <div class="collapse" id="collapseInstruction">
        <div class="card card-body">
            @switch($data["lab"])
                @case("lab1")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab1.xlsx')}}">dmt_lab1.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу є список критеріїв, по якому ми можемо обрахувати кращу або гіршу альтернативу. Якщо вибраний критерій "Песимізму-оптимізму Гурвиця", то потрібно зліва у поле яке появилося ввести коефіцієнт песимізму (наприклад 0.4). Якщо вибраний критерій Байєса-Лапласа, то потрібно ввести ймовірність під кожним станом (наприклад: 0.7, 0.4, 0.5, 0.8).</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab2_savage")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab2_savage.xlsx')}}">lab2_savage.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу ми можемо вибрати яку альтернативу обрахувати: кращу або гіршу.</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab2_expected_value")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab2_expected_value.xlsx')}}">lab2_expected_value.xlsx</a></p>
                <p>2. Знизу під відображеням даних з файлу потрібно ввести значення: C<sub>1</sub> - витрати на ремонт несправних комп'ютерів (наприклад 100); C<sub>2</sub> - витрати на профілактичний ремонт однієї машини (наприклад 10); n - випадкове значення кількості всіх комп’ютерів, що вийшли з ладу в той же момент (наприклад 50).</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab2_expected_value_dispersion")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab2_expected_value.xlsx')}}">lab2_expected_value.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу потрібно ввести значення: C<sub>1</sub> - витрати на ремонт несправних комп'ютерів (наприклад 100); C<sub>2</sub> - витрати на профілактичний ремонт однієї машини (наприклад 10); n - випадкове значення кількості всіх комп’ютерів, що вийшли з ладу в той же момент (наприклад 50).</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab2_average_expected_value")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab2_average_expected_value.xlsx')}}">lab2_average_expected_value.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу ми можемо вибрати яку альтернативу обрахувати: кращу або гіршу.</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab2_limit_level")
                    <p>1. Потрібно ввести значення: I<sub>1</sub> - мінімальне значення попиту (наприклад 10); I<sub>2</sub> - максимальне значення попиту (наприклад 20); A<sub>1</sub> - максимальна величина очікуваного дефіциту (наприклад 2); A<sub>2</sub> - максимальна величина очікуваних надлишків (наприклад 4).</p>
                    <p>2. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab3")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab3.xlsx')}}">lab3.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу ми можемо вибрати яку альтернативу обрахувати: кращу або гіршу.</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab4")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab4.xlsx')}}">lab4.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу ми можемо вибрати яку альтернативу обрахувати: кращу або гіршу.</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab5")
                    <p>1. Спочатку потрібно вибрати ексель файл і загрузити його. Приклад файлу: <a href="{{asset('excel/dmt_lab5.xlsx')}}">lab5.xlsx</a></p>
                    <p>2. Знизу під відображеням даних з файлу потрібно ввести під кожним параметром коефіцієнт цього параметра. В сумі коефіцієнти повині дорівнювати 1 (наприклад: 0.2, 0.2, 0.2, 0.25, 0.15). Знизу під кожним параметром є чекбокс, який відповідає за те, що цей параметр буде максимізуватися. Потрібно як мінімум один параметр, який буде максимізуватися і мінімізуватися (наприклад: false, true, false, true, false).</p>
                    <p>3. Натиснути кнопку "Вивести результат"</p>
                @break
                @case("lab6")
                    <p>1. Потрібно ввести X<sub>1</sub>..X<sub>4</sub> - параметри, для яких будуть обраховуватися коефіцієнти значимості (наприклад: 1.810, 1.055, 1.599, 1.682).</p>
                    <p>2. Натиснути кнопку "Вивести результат"</p>
                @break
            @endswitch
        </div>
    </div>
</div>
